aplus-arch-rpi.org
#+TITLE: Arch Linux for the Raspberry Pi A+

* Creating the SD Card
** A fork in the road
The instructions below are great if you've got a working Linux box and some
time to kill, but because that's not always the case. Someone somewhere on the
internet suggested grabbing the most recent Arch Linux ARM image (from
[2014-06-22 Sun], which can be found at
http://downloads.raspberrypi.org/arch/images/arch-2014-06-22/), write it do a
disk with =dd= the old fashioned way, and run
#+BEGIN_SRC sh
$ sudo pacman -Syu
#+END_SRC
to bring it up to date. This sounds like a reasonable method to me.

*** The easy way[fn:easy-way-note: Done on a MacBook Pro running OS 10.9.5. There are probably a million ways to do this, but here's mine.]
1. Download the [2014-06-22 Sun] Arch Linux ARM image linked above to somewhere
   convenient like =~/Downloads/ArchLinuxARM-2014.06-rpi.img.zip=.

2. Unzip the archive
   #+BEGIN_SRC sh
   $ unzip ~/Downloads/ArchLinuxARM-2014.06-rpi.img.zip -d ~/Downloads
   #+END_SRC
   (You can omit the =-d ~/Downloads= flag if you don't mind extracting to your
   current working directory, or you can =cd ~/Downloads= before this step.)

3. Insert a micro SD card, and try to find its mount
   point[fn:os-sd-card-mount-point: This is a little different on Linux. From
   what I recall, on elementary OS (an Ubuntu derivative), it's probably going
   to be somewhere like =/media/<device_name>=, although I may be mistaken---I
   mostly do this sort of thing in OS X.]:
   #+BEGIN_SRC sh
   $ diskutil list
   #+END_SRC
   and you'll see something like
   #+BEGIN_SRC plain
   /dev/disk0
      #:                       TYPE NAME                    SIZE       IDENTIFIER
      0:      GUID_partition_scheme                        *750.2 GB   disk0
      1:                        EFI EFI                     209.7 MB   disk0s1
      2:                  Apple_HFS Foo                     500.1 GB   disk0s2
      3:                  Apple_HFS Bar                     249.6 GB   disk0s3
   /dev/disk1
      #:                       TYPE NAME                    SIZE       IDENTIFIER
      0:      GUID_partition_scheme                        *1.0 TB     disk1
      1:                        EFI EFI                     209.7 MB   disk1s1
      2:                  Apple_HFS Baz                     499.6 GB   disk1s2
      3:                 Apple_Boot Recovery HD             650.0 MB   disk1s3
      4:       Microsoft Basic Data Qux                     250.2 GB   disk1s4
      5:       Microsoft Basic Data Blah                    249.6 GB   disk1s5
   /dev/disk2
      #:                       TYPE NAME                    SIZE       IDENTIFIER
      0:     FDisk_partition_scheme                        *4.0 GB     disk2
      1:             Windows_FAT_32 NO NAME                 94.4 MB    disk2s1
      2:                      Linux                         3.9 GB     disk2s5
   #+END_SRC
   You want the root of the one that's clearly an SD card---in this case,
   =/dev/disk2=.[fn:disk-rdisk: In OS X, at least, what you /really/ want is
   =/dev/rdisk2= when you're doing th writing. It's the raw disk, and it's
   /much/ faster]

4. Unmount the micro SD card:
   #+BEGIN_SRC sh
   $ diskutil unmountDisk /dev/disk2
   #+END_SRC
   Note that in your case, the disk number maybe be different!

5. Write the image to the file:
   #+BEGIN_SRC sh
   $ sudo dd bs=1m if=~/Downloads/ArchLinuxARM-2014.06-rpi.img of=/dev/rdisk2
   #+END_SRC
   (That ~bs=1m~ line is pretty important, and on OS X, the =m= is in fact
   lowercase.)
   
   This will take some time, but on OS X (and maybe Linux?), hitting CTRL-t
   will show you that something is happening, e.g.
   #+BEGIN_SRC plain
   load: 1.72  cmd: dd 28927 uninterruptible 0.00u 0.19s
   210+0 records in
   209+0 records out
   219152384 bytes transferred in 45.639970 secs (4801764 bytes/sec)
   #+END_SRC
   In my case, the process took almost 7 minutes.

6. Unmount the disk again:
   #+BEGIN_SRC sh
   $ diskutil unmountDisk /dev/disk2
   #+END_SRC

7. Put it in the A+, and you're (sort of) on your way!


