aplus-arch-rpi.html
<!DOCTYPE html>
<html>
<head>
<title>Arch Linux for the Raspberry Pi A+</title>
<!-- 2014-12-08 Mon 11:01 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Ryan Matlock">
<link rel="stylesheet" type="text/css" href="https://RyanMatlock.github.io/org-style/org-style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Arch Linux for the Raspberry Pi A+</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Creating the SD Card</a>
<ul>
<li><a href="#sec-1-1">1.1. A fork in the road</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. The easy way</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. The instructions per the Arch Linux ARM folks</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Getting everything up and running</a>
<ul>
<li><a href="#sec-2-1">2.1. Turning it on</a></li>
<li><a href="#sec-2-2">2.2. Wireless networking</a></li>
<li><a href="#sec-2-3">2.3. Add a user</a></li>
<li><a href="#sec-2-4">2.4. It's time to update Arch</a></li>
<li><a href="#sec-2-5">2.5. Install <code>sudo</code></a></li>
<li><a href="#sec-2-6">2.6. Install <code>emacs</code></a></li>
<li><a href="#sec-2-7">2.7. Configure <code>sudo</code></a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. Disabling <code>root</code> login</a></li>
</ul>
</li>
<li><a href="#sec-2-8">2.8. Enable SSH access</a></li>
<li><a href="#sec-2-9">2.9. Change the hostname (optional, but recommended)</a></li>
<li><a href="#sec-2-10">2.10. SSH issues</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Further necessary configuration</a>
<ul>
<li><a href="#sec-3-1">3.1. Install <code>git</code></a></li>
<li><a href="#sec-3-2">3.2. Install <code>python</code> and useful related dependencies</a></li>
<li><a href="#sec-3-3">3.3. A note</a></li>
<li><a href="#sec-3-4">3.4. Add your GitHub SSH keys</a></li>
<li><a href="#sec-3-5">3.5. Set up bash how you like it</a></li>
<li><a href="#sec-3-6">3.6. Expand the root partition</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Creating the SD Card</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> A fork in the road</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The instructions below are great if you've got a working Linux box and some
time to kill, but because that's not always the case. Someone somewhere on the
internet suggested grabbing the most recent Arch Linux ARM image (from
<span class="timestamp-wrapper"><span class="timestamp">[2014-06-22 Sun]</span></span>, which can be found at
<a href="http://downloads.raspberrypi.org/arch/images/arch-2014-06-22/">http://downloads.raspberrypi.org/arch/images/arch-2014-06-22/</a>), write it do a
disk with <code>dd</code> the old fashioned way, and run
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo pacman -Syu
</pre>
</div>
<p>
to bring it up to date. This sounds like a reasonable method to me.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> The easy way<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h4>
<div class="outline-text-4" id="text-1-1-1">
<ol class="org-ol">
<li>Download the <span class="timestamp-wrapper"><span class="timestamp">[2014-06-22 Sun]</span></span> Arch Linux ARM image linked above to somewhere
convenient like <code>~/Downloads/ArchLinuxARM-2014.06-rpi.img.zip</code>.
</li>

<li>Unzip the archive
<div class="org-src-container">

<pre class="src src-sh">$ unzip ~/Downloads/ArchLinuxARM-2014.06-rpi.img.zip -d ~/Downloads
</pre>
</div>
<p>
(You can omit the <code>-d ~/Downloads</code> flag if you don't mind extracting to your
current working directory, or you can <code>cd ~/Downloads</code> before this step.)
</p>
</li>

<li>Insert a micro SD card, and try to find its mount
point<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>:
<div class="org-src-container">

<pre class="src src-sh">$ diskutil list
</pre>
</div>
<p>
and you'll see something like
</p>
<div class="org-src-container">

<pre class="src src-plain">/dev/disk0
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:      GUID_partition_scheme                        *750.2 GB   disk0
   1:                        EFI EFI                     209.7 MB   disk0s1
   2:                  Apple_HFS Foo                     500.1 GB   disk0s2
   3:                  Apple_HFS Bar                     249.6 GB   disk0s3
/dev/disk1
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:      GUID_partition_scheme                        *1.0 TB     disk1
   1:                        EFI EFI                     209.7 MB   disk1s1
   2:                  Apple_HFS Baz                     499.6 GB   disk1s2
   3:                 Apple_Boot Recovery HD             650.0 MB   disk1s3
   4:       Microsoft Basic Data Qux                     250.2 GB   disk1s4
   5:       Microsoft Basic Data Blah                    249.6 GB   disk1s5
/dev/disk2
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:     FDisk_partition_scheme                        *4.0 GB     disk2
   1:             Windows_FAT_32 NO NAME                 94.4 MB    disk2s1
   2:                      Linux                         3.9 GB     disk2s5
</pre>
</div>
<p>
You want the root of the one that's clearly an SD card&#x2014;in this case,
<code>/dev/disk2</code>.<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>
</li>

<li>Unmount the micro SD card:
<div class="org-src-container">

<pre class="src src-sh">$ diskutil unmountDisk /dev/disk2
</pre>
</div>
<p>
Note that in your case, the disk number maybe be different!
</p>
</li>

<li>Write the image to the file:
<div class="org-src-container">

<pre class="src src-sh">$ sudo dd <span style="color: #a0522d;">bs</span>=1m <span style="color: #a0522d;">if</span>=~/Downloads/ArchLinuxARM-2014.06-rpi.img <span style="color: #a0522d;">of</span>=/dev/rdisk2
</pre>
</div>
<p>
(That <code>bs=1m</code> line is pretty important, and on OS X, the <code>m</code> is in fact
lowercase.)
</p>

<p>
This will take some time, but on OS X (and maybe Linux?), hitting CTRL-t
will show you that something is happening, e.g.
</p>
<div class="org-src-container">

<pre class="src src-plain">load: 1.72  cmd: dd 28927 uninterruptible 0.00u 0.19s
210+0 records in
209+0 records out
219152384 bytes transferred in 45.639970 secs (4801764 bytes/sec)
</pre>
</div>
<p>
In my case, the process took almost 7 minutes.
</p>
</li>

<li>Unmount the disk again:
<div class="org-src-container">

<pre class="src src-sh">$ diskutil unmountDisk /dev/disk2
</pre>
</div>
</li>

<li>Put it in the A+, and you're (sort of) on your way!
</li>
</ol>
</div>
</div>
</div>
