aplus-arch-rpi.org
** The instructions per the Arch Linux ARM folks[fn:source-sd-card: http://archlinuxarm.org/platforms/armv6/raspberry-pi on [2014-12-07 Sun]. These instructions seem to change often enough that it seems prudent to record them verbatim here.]
Replace =<sdX>= in the following instructions with the device name for the SD card
as it appears on your computer.

1. Start fdisk to partition the SD card:
   #+BEGIN_SRC sh
   $ fdisk /dev/<sdX>
   #+END_SRC

2. At the fdisk prompt, delete old partitions and create a new one:
   a. Type =o=. This will clear out any partitions on the drive.
   b. Type =p= to list partitions. There should be no partitions left.
   c. Type =n=, then =p= for primary, =1= for the first partition on the drive,
      press ENTER to accept the default first sector, then type =+100M= for the
      last sector.
   d. Type =t=, then =c= to set the first partition to type W95 FAT32 (LBA).
   e. Type =n=, then =p= for primary, =2= for the second partition on the
      drive, and then press ENTER twice to accept the default first and last
      sector.
   f. Write the partition table and exit by typing =w=.

3. Create and mount the FAT filesystem:
   #+BEGIN_SRC sh
   $ mkfs.vfat /dev/<sdX>1
   $ mkdir boot
   $ mount /dev/<sdX>1 boot
   #+END_SRC

4. Create and mount the ext4 filesystem:
   #+BEGIN_SRC sh
   $ mkfs.ext4 /dev/<sdX>2
   $ mkdir root
   $ mount /dev/<sdX>2 root
   #+END_SRC

5. Download and extract the root filesystem (as root, not via sudo):
   #+BEGIN_SRC sh
   # wget http://archlinuxarm.org/os/ArchLinuxARM-rpi-latest.tar.gz
   # bsdtar -xpf ArchLinuxARM-rpi-latest.tar.gz -C root
   # sync
   #+END_SRC

6. Move boot files to the first partition:[fn:sd-card-shell-login-level: I'm
   unclear whether or not this is as root or the user]
   #+BEGIN_SRC sh
   $ mv root/boot/* boot
   #+END_SRC

7. Unmount the two partitions:
   #+BEGIN_SRC sh
   $ umount boot root
   #+END_SRC

8. Insert the SD card into the Raspberry Pi, connect ethernet, and apply 5V
   power.

9. Use the serial console or SSH to the IP address given to the board by your
   router. The default root password is 'root'.

* Getting everything up and running

** Turning it on
You'll want a powered USB hub, a wired USB keyboard (I had problems with my USB
transceiver-based Microsoft Sculpt, but no problems with my old Apple wired
keyboard), and a USB wifi dongle (I've always had good luck with the Edimax
ones---they're ubiquitious and therefore well supported).

The login/password is =root=.

** Wireless networking
If you're using the Edimax wifi dongle, you shouldn't have any issues. Just
check that it's connected with[fn:root-note: =#= means =root=, =$= means some
user]
#+BEGIN_SRC sh
# dmesg | grep usbcore
#+END_SRC
or
#+BEGIN_SRC sh
# dmesg | grep rt18192cu
#+END_SRC
and hope you get results. If/when you do,
#+BEGIN_SRC sh
# cd /etc/netctl
# cp examples/wireless-wpa <name>
#+END_SRC
Don't get too fancy with =<name>=---I had trouble with =matlock.home=, but not
with =home=.

** Add a user
Might as well make yourself a member of =wheel= (this will come up later).

** It's time to update Arch
#+BEGIN_SRC sh
# pacman -Syu
#+END_SRC
I couldn't even install =sudo= without this, so it's pretty important. Anyway,
just say yes to everything (probably). It'll take awhile, but it'll also fix
tha nasty bash bug (shellshock?) among other things. In my case, there were 103
things that needed updating, which required downloading, unpacking, etc., so
yeah, it took quite awhile. (Don't be alarmed if the screen turns off---it's
just fallen asleep, so press a key to wake it up if you'd like.)

That whole process took somewhere between 30 minutes and an hours, I think.

** Install =sudo=
#+BEGIN_SRC sh
# pacman -S sudo
#+END_SRC

** Install =emacs=
Because trying to find stuff in =nano= is terrible.
#+BEGIN_SRC sh
# pacman -S emacs
#+END_SRC
Ok, admittedly, 300+MB is a lot, especially when I haven't even expanded the
filesystem yet, but I just can't wrap my mind around =vim= (nor do I especially
want to).

** Configure =sudo=
You *must* use =visudo= to edit the configuration file for =sudo=, which lives
at =/etc/sudoers=. Set =emacs= as the =visudo= editor:
#+BEGIN_SRC sh
# EDITOR=emacs visudo
#+END_SRC

To do this permanently, add these lines to the bottom of =/etc/sudoers=:
#+BEGIN_SRC plain
# reset environment by default
Defaults env_reset
# set default EDITOR to emacs, and do not allow visudo to use EDITOR/VISUAL
Defaults editor=/usr/bin/emacs, !env_editor
#+END_SRC
Despite what https://wiki.archlinux.org/index.php/sudo#Defaults_Skeleton says,
it looks like the =!env_editor=, as well as a new line saying =Defaults
!env_editor= causes =visudo= to complain of a syntax error, so I guess you'll
just have to ignore that for now.

Now for the really important stuff: remember how you added yourself to the
group =wheel= when you made your user account? =wheel= is generally taken to be
the admin group. Find and uncomment the line
#+BEGIN_SRC plain
# %wheel ALL=(ALL) ALL
#+END_SRC
to give =wheel= members sudo privileges.

Run
#+BEGIN_SRC sh
# sudo -ll
#+END_SRC
to verify that everything looks right.

At this point, you should log out of =root= and log back in as =<user>=. As a
result, the terminal prompt will be represented by =$= instead of =#=.

*** Disabling =root= login
+This is pretty important, but I think you'll do it in a bit over SSH.+ No,
just do this now.  See
https://wiki.archlinux.org/index.php/sudo#Disable_root_login.

Since you're now logged in as a user, we'll have to use =sudo= (and make sure
you do this as a user instead of =root= to ensure you haven't messed anything
up!!).
#+BEGIN_SRC sh
$ sudo passwd -l root
#+END_SRC

