aplus-arch-rpi.html


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> The instructions per the Arch Linux ARM folks<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Replace <code>&lt;sdX&gt;</code> in the following instructions with the device name for the SD card
as it appears on your computer.
</p>

<ol class="org-ol">
<li>Start fdisk to partition the SD card:
<div class="org-src-container">

<pre class="src src-sh">$ fdisk /dev/&lt;sdX&gt;
</pre>
</div>
</li>

<li>At the fdisk prompt, delete old partitions and create a new one:
<ol class="org-ol">
<li>Type <code>o</code>. This will clear out any partitions on the drive.
</li>
<li>Type <code>p</code> to list partitions. There should be no partitions left.
</li>
<li>Type <code>n</code>, then <code>p</code> for primary, <code>1</code> for the first partition on the drive,
press ENTER to accept the default first sector, then type <code>+100M</code> for the
last sector.
</li>
<li>Type <code>t</code>, then <code>c</code> to set the first partition to type W95 FAT32 (LBA).
</li>
<li>Type <code>n</code>, then <code>p</code> for primary, <code>2</code> for the second partition on the
drive, and then press ENTER twice to accept the default first and last
sector.
</li>
<li>Write the partition table and exit by typing <code>w</code>.
</li>
</ol>
</li>

<li>Create and mount the FAT filesystem:
<div class="org-src-container">

<pre class="src src-sh">$ mkfs.vfat /dev/&lt;sdX&gt;1
$ mkdir boot
$ mount /dev/&lt;sdX&gt;1 boot
</pre>
</div>
</li>

<li>Create and mount the ext4 filesystem:
<div class="org-src-container">

<pre class="src src-sh">$ mkfs.ext4 /dev/&lt;sdX&gt;2
$ mkdir root
$ mount /dev/&lt;sdX&gt;2 root
</pre>
</div>
</li>

<li>Download and extract the root filesystem (as root, not via sudo):
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">wget http://archlinuxarm.org/os/ArchLinuxARM-rpi-latest.tar.gz</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">bsdtar -xpf ArchLinuxARM-rpi-latest.tar.gz -C root</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">sync</span>
</pre>
</div>
</li>

<li>Move boot files to the first partition:<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>
<div class="org-src-container">

<pre class="src src-sh">$ mv root/boot/* boot
</pre>
</div>
</li>

<li>Unmount the two partitions:
<div class="org-src-container">

<pre class="src src-sh">$ umount boot root
</pre>
</div>
</li>

<li>Insert the SD card into the Raspberry Pi, connect ethernet, and apply 5V
power.
</li>

<li>Use the serial console or SSH to the IP address given to the board by your
router. The default root password is 'root'.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting everything up and running</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Turning it on</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You'll want a powered USB hub, a wired USB keyboard (I had problems with my USB
transceiver-based Microsoft Sculpt, but no problems with my old Apple wired
keyboard), and a USB wifi dongle (I've always had good luck with the Edimax
ones&#x2014;they're ubiquitious and therefore well supported).
</p>

<p>
The login/password is <code>root</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Wireless networking</h3>
<div class="outline-text-3" id="text-2-2">
<p>
If you're using the Edimax wifi dongle, you shouldn't have any issues. Just
check that it's connected with<sup><a id="fnr.6" name="fnr.6" class="footref" href="#fn.6">6</a></sup>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">dmesg | grep usbcore</span>
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">dmesg | grep rt18192cu</span>
</pre>
</div>
<p>
and hope you get results. If/when you do,
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">cd /etc/netctl</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">cp examples/wireless-wpa &lt;name&gt;</span>
</pre>
</div>
<p>
Don't get too fancy with <code>&lt;name&gt;</code>&#x2014;I had trouble with <code>matlock.home</code>, but not
with <code>home</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Add a user</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Might as well make yourself a member of <code>wheel</code> (this will come up later).
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> It's time to update Arch</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">pacman -Syu</span>
</pre>
</div>
<p>
I couldn't even install <code>sudo</code> without this, so it's pretty important. Anyway,
just say yes to everything (probably). It'll take awhile, but it'll also fix
tha nasty bash bug (shellshock?) among other things. In my case, there were 103
things that needed updating, which required downloading, unpacking, etc., so
yeah, it took quite awhile. (Don't be alarmed if the screen turns off&#x2014;it's
just fallen asleep, so press a key to wake it up if you'd like.)
</p>

<p>
That whole process took somewhere between 30 minutes and an hours, I think.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Install <code>sudo</code></h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">pacman -S sudo</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Install <code>emacs</code></h3>
<div class="outline-text-3" id="text-2-6">
<p>
Because trying to find stuff in <code>nano</code> is terrible.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">pacman -S emacs</span>
</pre>
</div>
<p>
Ok, admittedly, 300+MB is a lot, especially when I haven't even expanded the
filesystem yet, but I just can't wrap my mind around <code>vim</code> (nor do I especially
want to).
</p>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Configure <code>sudo</code></h3>
<div class="outline-text-3" id="text-2-7">
<p>
You <b>must</b> use <code>visudo</code> to edit the configuration file for <code>sudo</code>, which lives
at <code>/etc/sudoers</code>. Set <code>emacs</code> as the <code>visudo</code> editor:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">EDITOR=emacs visudo</span>
</pre>
</div>

<p>
To do this permanently, add these lines to the bottom of <code>/etc/sudoers</code>:
</p>
<div class="org-src-container">

<pre class="src src-plain"># reset environment by default
Defaults env_reset
# set default EDITOR to emacs, and do not allow visudo to use EDITOR/VISUAL
Defaults editor=/usr/bin/emacs, !env_editor
</pre>
</div>
<p>
Despite what <a href="https://wiki.archlinux.org/index.php/sudo#Defaults_Skeleton">https://wiki.archlinux.org/index.php/sudo#Defaults_Skeleton</a> says,
it looks like the <code>!env_editor</code>, as well as a new line saying <code>Defaults
!env_editor</code> causes <code>visudo</code> to complain of a syntax error, so I guess you'll
just have to ignore that for now.
</p>

<p>
Now for the really important stuff: remember how you added yourself to the
group <code>wheel</code> when you made your user account? <code>wheel</code> is generally taken to be
the admin group. Find and uncomment the line
</p>
<div class="org-src-container">

<pre class="src src-plain"># %wheel ALL=(ALL) ALL
</pre>
</div>
<p>
to give <code>wheel</code> members sudo privileges.
</p>

<p>
Run
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">sudo -ll</span>
</pre>
</div>
<p>
to verify that everything looks right.
</p>

<p>
At this point, you should log out of <code>root</code> and log back in as <code>&lt;user&gt;</code>. As a
result, the terminal prompt will be represented by <code>$</code> instead of <code>#</code>.
</p>
</div>

<div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> Disabling <code>root</code> login</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
<del>This is pretty important, but I think you'll do it in a bit over SSH.</del> No,
just do this now.  See
<a href="https://wiki.archlinux.org/index.php/sudo#Disable_root_login">https://wiki.archlinux.org/index.php/sudo#Disable_root_login</a>.
</p>

<p>
Since you're now logged in as a user, we'll have to use <code>sudo</code> (and make sure
you do this as a user instead of <code>root</code> to ensure you haven't messed anything
up!!).
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo passwd -l root
</pre>
</div>
</div>
</div>
</div>
